posts/2016-03-20-prayer-for-palm-sunday.org
#+date: <2016-03-20>
#+filetags: prayer religion
#+title: Prayer for Palm Sunday

Prince of Peace,

The palm branches\\
waving in Jerusalem\\
symbolized the dreams\\
of the people,\\
dreams of defeated enemies,\\
and a peace gained by\\
the overwhelming force of\\
divine power and might.

Instead of palms,\\
we wave flags,\\
grander symbols\\
of the same dreams.

Give us a new vision\\
of a world where\\
there are no enemies\\
to vanquish and\\
no wars to fight.

Not because we have won,\\
but because we have\\
finally surrendered,\\
and all of our weapons\\
have been thrown down\\
at the foot of the cross.

Give me the courage to be the first.

/Amen/

