docs/posts/2016-03-20-prayer-for-palm-sunday.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for Palm Sunday</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for Palm Sunday</h1>
<p class="subtitle" role="doc-subtitle">Mar 20, 2016</p>
</header><p>
Prince of Peace,
</p>

<p>
The palm branches<br>
waving in Jerusalem<br>
symbolized the dreams<br>
of the people,<br>
dreams of defeated enemies,<br>
and a peace gained by<br>
the overwhelming force of<br>
divine power and might.
</p>

<p>
Instead of palms,<br>
we wave flags,<br>
grander symbols<br>
of the same dreams.
</p>

<p>
Give us a new vision<br>
of a world where<br>
there are no enemies<br>
to vanquish and<br>
no wars to fight.
</p>

<p>
Not because we have won,<br>
but because we have<br>
finally surrendered,<br>
and all of our weapons<br>
have been thrown down<br>
at the foot of the cross.
</p>

<p>
Give me the courage to be the first.
</p>

<p>
<i>Amen</i>
</p>



<div class="tagline" id="org5d8aae2">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
